{"question_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "<PAD>": 4, ";": 5, "Are": 6, "Do": 7, "Does": 8, "How": 9, "Is": 10, "The": 11, "There": 12, "What": 13, "a": 14, "and": 15, "another": 16, "any": 17, "anything": 18, "are": 19, "as": 20, "ball": 21, "balls": 22, "behind": 23, "big": 24, "block": 25, "blocks": 26, "blue": 27, "both": 28, "brown": 29, "color": 30, "cube": 31, "cubes": 32, "cyan": 33, "cylinder": 34, "cylinders": 35, "either": 36, "else": 37, "fewer": 38, "front": 39, "gray": 40, "greater": 41, "green": 42, "has": 43, "have": 44, "how": 45, "in": 46, "is": 47, "it": 48, "its": 49, "large": 50, "left": 51, "less": 52, "made": 53, "many": 54, "material": 55, "matte": 56, "metal": 57, "metallic": 58, "more": 59, "number": 60, "object": 61, "objects": 62, "of": 63, "on": 64, "or": 65, "other": 66, "purple": 67, "red": 68, "right": 69, "rubber": 70, "same": 71, "shape": 72, "shiny": 73, "side": 74, "size": 75, "small": 76, "sphere": 77, "spheres": 78, "than": 79, "that": 80, "the": 81, "there": 82, "thing": 83, "things": 84, "tiny": 85, "to": 86, "visible": 87, "what": 88, "yellow": 89, "an": 90, "equal": 91}, "program_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "<PAD>": 4, "count": 5, "equal_color": 6, "equal_integer": 7, "equal_material": 8, "equal_shape": 9, "equal_size": 10, "exist": 11, "filter_color[blue]": 12, "filter_color[brown]": 13, "filter_color[cyan]": 14, "filter_color[gray]": 15, "filter_color[green]": 16, "filter_color[purple]": 17, "filter_color[red]": 18, "filter_color[yellow]": 19, "filter_material[metal]": 20, "filter_material[rubber]": 21, "filter_shape[cube]": 22, "filter_shape[cylinder]": 23, "filter_shape[sphere]": 24, "filter_size[large]": 25, "filter_size[small]": 26, "greater_than": 27, "intersect": 28, "less_than": 29, "query_color": 30, "query_material": 31, "query_shape": 32, "query_size": 33, "relate[behind]": 34, "relate[front]": 35, "relate[left]": 36, "relate[right]": 37, "same_color": 38, "same_material": 39, "same_shape": 40, "same_size": 41, "scene": 42, "union": 43, "unique": 44}, "answer_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "<PAD>": 4, "0": 5, "1": 6, "2": 7, "3": 8, "4": 9, "5": 10, "False": 11, "True": 12, "blue": 13, "brown": 14, "cube": 15, "cyan": 16, "cylinder": 17, "gray": 18, "green": 19, "large": 20, "metal": 21, "purple": 22, "red": 23, "rubber": 24, "small": 25, "sphere": 26, "yellow": 27}}